Tekla Open API Reference for Tekla Structures 2025
WpfProfileCatalog Properties
The WpfProfileCatalog type exposes the following members.
Properties
Name | Description
ButtonHeight
 Gets and sets the height of the button control.
ButtonText
 Gets and sets the text of the button control.
ButtonWidth
 Gets and sets the width of the button control.
SelectedProfile
 The selected profile in the control.
Top
See Also
Reference
WpfProfileCatalog Class
Tekla.Structures.Dialog.UIControls Namespace